-----------------------------------------------------------------------------------
------------------------ АВТОМАУНТ ВЫДАЧА ПРИ СОЗДАНИИ ЧАРА ------------------------------------
-----------------------------------------------------------------------------------
-- Принцип работы: игрок создает персонажа, логинится в игру и получает доступ ко всем маунтам на персонажа

local MOUNT_SPELLS = { 458, 459 } -- массив со списком спеллов маунтов

local function OnFirstLogin(event, player)
    for _, spellId in ipairs(MOUNT_SPELLS) do
        player:LearnSpell(spellId)
    end
end

RegisterPlayerEvent(30, OnFirstLogin) -- 30 это PLAYER_EVENT_ON_FIRST_LOGIN